Revit 2026 API

# AnalyticalNodeData Class

---

This class holds information related to analytical model.

SystemObject Autodesk.Revit.DB.StructureAnalyticalNodeData

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AnalyticalNodeData : IDisposable
```
```vb
Public Class AnalyticalNodeData
	Implements IDisposable
```
```cpp
public ref class AnalyticalNodeData : IDisposable
```
```fsharp
type AnalyticalNodeData =
    class
        interface IDisposable
    end
```

The AnalyticalNodeData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the AnalyticalNodeData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAnalyticalNodeData | Returns AnalyticalNodeData associated with this element, if it exists. |
|  | GetConnectionStatus | Returns the Connection Status for this Analytical Node. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This class is attached to a ReferencePoint.

#### Reference

Autodesk.Revit.DB.Structure Namespace